Exploratory Data Analysis (EDA) in Python is the process of using libraries like Pandas, NumPy, Matplotlib, and Seaborn to summarise and understand the main characteristics of a dataset, identify patterns, and prepare the data for modeling.

In [1]:
import pandas as pd
import numpy as np 
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
customers=pd.read_csv(r"C:\Users\nihar\Downloads\restaurant_customers.csv")
customers

,ID,First Name,Last Name,Gender,Company,Occupation
0,1,Joseph,Perkins,Male,Dynazzy,Community Outreach Specialist
1,2,Jennifer,Alvarez,Female,DabZ,Senior Quality Engineer
2,3,Roger,Black,Male,Tagfeed,Account Executive
3,4,Steven,Evans,Male,Fatz,Registered Nurse
4,5,Judy,Morrison,Female,Demivee,Legal Assistant
...,...,...,...,...,...,...
995,996,Debra,Garcia,Female,Dazzlesphere,Structural Engineer
996,997,Douglas,Bishop,Male,Livepath,Developer I
997,998,Frank,Franklin,Male,Brainverse,Nurse Practicioner
998,999,Jessica,Burns,Female,Babbleblab,Financial Advisor
999,1000,Brian,Daniels,Male,Tazzy,Physical Therapy Assistant

In [3]:
foods=pd.read_csv(r"C:\Users\nihar\Downloads\restaurant_foods.csv")
foods

   Food ID   Food Item  Price
0        1       Sushi   3.99
1        2     Burrito   9.99
2        3        Taco   2.99
3        4  Quesadilla   4.25
4        5       Pizza   2.49
5        6       Pasta  13.99
6        7       Steak  24.99
7        8       Salad  11.25
8        9       Donut   0.99
9       10       Drink   1.75

In [4]:
sales1=pd.read_csv(r"C:\Users\nihar\Downloads\restaurant_week_1_sales.csv")
sales1

     Customer ID  Food ID
0            537        9
1             97        4
2            658        1
3            202        2
4            155        9
..           ...      ...
245          413        9
246          926        6
247          134        3
248          396        6
249          535       10

[250 rows x 2 columns]

In [5]:
sales2=pd.read_csv(r"C:\Users\nihar\Downloads\restaurant_week_2_sales.csv")
sales2

     Customer ID  Food ID
0            688       10
1            813        7
2            495       10
3            189        5
4            267        3
..           ...      ...
245          783       10
246          556       10
247          547        9
248          252        9
249          249        6

[250 rows x 2 columns]

In [6]:
times1=pd.read_csv(r"C:\Users\nihar\Downloads\restaurant_week_1_times.csv")
times1

    Time of Day
0      14:54:59
1      20:55:17
2      01:16:22
3      16:17:26
4      19:26:11
..          ...
245    04:44:14
246    07:46:21
247    20:45:08
248    01:09:06
249    18:18:50

[250 rows x 1 columns]

In [7]:
#Merging tables/DataFrames using concat function with common column names

In [8]:
foods.head(0)

Empty DataFrame
Columns: [Food ID, Food Item, Price]
Index: []

In [9]:
sales1.head(0)

Empty DataFrame
Columns: [Customer ID, Food ID]
Index: []

In [10]:
sales2.head(0)

Empty DataFrame
Columns: [Customer ID, Food ID]
Index: []

In [11]:
#These 3 datasets have three common columns 'Food ID' and 2 common columns 'Customer ID'

In [12]:
#Now we will merge sales1 and sales2

In [13]:
len(sales1)

250

In [14]:
len(sales2)

250

In [15]:
#sales1 and sales2 both have the same lengths making them suitable to merge

In [16]:
#To merge sales1 and sales2, use concat function

In [17]:
pd.concat([sales1,sales2])

     Customer ID  Food ID
0            537        9
1             97        4
2            658        1
3            202        2
4            155        9
..           ...      ...
245          783       10
246          556       10
247          547        9
248          252        9
249          249        6

[500 rows x 2 columns]

In [18]:
#It shows 500 rows meaning the datasets have been merged but sales2 starts from 0 again which is why the last row shows 249 instead of 500

In [19]:
pd.concat([sales1,sales2],ignore_index=False)

     Customer ID  Food ID
0            537        9
1             97        4
2            658        1
3            202        2
4            155        9
..           ...      ...
245          783       10
246          556       10
247          547        9
248          252        9
249          249        6

[500 rows x 2 columns]

In [20]:
#ignore_index=False ignores any changes to be made to the dataset

In [21]:
pd.concat([sales1,sales2],ignore_index=True)

     Customer ID  Food ID
0            537        9
1             97        4
2            658        1
3            202        2
4            155        9
..           ...      ...
495          783       10
496          556       10
497          547        9
498          252        9
499          249        6

[500 rows x 2 columns]

In [22]:
#ignore_index=True combines the indices of both the datasets

In [23]:
pd.concat([sales1,sales2],keys=["Sales 1","Sales 2"]).sort_index()

             Customer ID  Food ID
Sales 1 0            537        9
        1             97        4
        2            658        1
        3            202        2
        4            155        9
...                  ...      ...
Sales 2 245          783       10
        246          556       10
        247          547        9
        248          252        9
        249          249        6

[500 rows x 2 columns]

In [24]:
#By assigning keys, we are assigning names to the indices and then using sort_index, the dataset is in alphabetical chronology

In [25]:
#concat using unequal lengths of datasets

In [26]:
df1=pd.DataFrame([1,2,3,],columns=["A"])
df1

   A
0  1
1  2
2  3

In [27]:
df2=pd.DataFrame([4,5,6],columns=["B"])
df2

   B
0  4
1  5
2  6

In [28]:
#The issue: using concat, the datasets can be merged but the second dataset comes below instead of adjacently

In [29]:
pd.concat([df1,df2])

     A    B
0  1.0  NaN
1  2.0  NaN
2  3.0  NaN
0  NaN  4.0
1  NaN  5.0
2  NaN  6.0

In [30]:
pd.concat([df1,df2],axis="index")

     A    B
0  1.0  NaN
1  2.0  NaN
2  3.0  NaN
0  NaN  4.0
1  NaN  5.0
2  NaN  6.0

In [31]:
pd.concat([df1,df2],axis="columns")

   A  B
0  1  4
1  2  5
2  3  6

In [32]:
#By assigning columns to the index, the datasets are now merged adjacently

In [33]:
#Merge: Left Joins

In [34]:
sales1.head()

   Customer ID  Food ID
0          537        9
1           97        4
2          658        1
3          202        2
4          155        9

In [35]:
foods.head()

   Food ID   Food Item  Price
0        1       Sushi   3.99
1        2     Burrito   9.99
2        3        Taco   2.99
3        4  Quesadilla   4.25
4        5       Pizza   2.49

In [36]:
#Food ID is the common column here. Now we want to merge the Food ID columns for sales1 and foods which becomes a Left Join

In [37]:
sales1.merge(foods,how="left",on="Food ID")

     Customer ID  Food ID   Food Item  Price
0            537        9       Donut   0.99
1             97        4  Quesadilla   4.25
2            658        1       Sushi   3.99
3            202        2     Burrito   9.99
4            155        9       Donut   0.99
..           ...      ...         ...    ...
245          413        9       Donut   0.99
246          926        6       Pasta  13.99
247          134        3        Taco   2.99
248          396        6       Pasta  13.99
249          535       10       Drink   1.75

[250 rows x 4 columns]

In [38]:
#Merge: Right Joins

In [39]:
sales2.head()

   Customer ID  Food ID
0          688       10
1          813        7
2          495       10
3          189        5
4          267        3

In [40]:
customers.head()

   ID First Name Last Name  Gender  Company                     Occupation
0   1     Joseph   Perkins    Male  Dynazzy  Community Outreach Specialist
1   2   Jennifer   Alvarez  Female     DabZ        Senior Quality Engineer
2   3      Roger     Black    Male  Tagfeed              Account Executive
3   4     Steven     Evans    Male     Fatz               Registered Nurse
4   5       Judy  Morrison  Female  Demivee                Legal Assistant

In [41]:
#Now we want to merge Customer ID and ID from sales 2 and customers, respectively

In [42]:
sales2.merge(customers,how="left",left_on="Customer ID",right_on="ID")

,Customer ID,Food ID,ID,First Name,Last Name,Gender,Company,Occupation
0,688,10,688,Carl,Williamson,Male,Thoughtmix,Graphic Designer
1,813,7,813,Johnny,Walker,Male,Kayveo,Developer II
2,495,10,495,Deborah,Little,Female,Babbleblab,VP Accounting
3,189,5,189,Roger,Gordon,Male,Skilith,Operator
4,267,3,267,Matthew,Wood,Male,Agimba,Product Engineer
...,...,...,...,...,...,...,...,...
245,783,10,783,Phyllis,Meyer,Female,Voolia,Information Systems Manager
246,556,10,556,Samuel,Bailey,Male,Oyoloo,Nurse
247,547,9,547,Tina,Watkins,Female,Thoughtstorm,Accountant II
248,252,9,252,Douglas,Powell,Male,Jetwire,Geologist IV
249,249,6,249,Anthony,Carpenter,Male,Shuffletag,Health Coach I

In [43]:
#The issue: the datasets have been merged but ID is a separate column

In [44]:
sales2.merge(customers,how="left",left_on="Customer ID",right_on="ID").drop("ID",axis="columns")

,Customer ID,Food ID,First Name,Last Name,Gender,Company,Occupation
0,688,10,Carl,Williamson,Male,Thoughtmix,Graphic Designer
1,813,7,Johnny,Walker,Male,Kayveo,Developer II
2,495,10,Deborah,Little,Female,Babbleblab,VP Accounting
3,189,5,Roger,Gordon,Male,Skilith,Operator
4,267,3,Matthew,Wood,Male,Agimba,Product Engineer
...,...,...,...,...,...,...,...
245,783,10,Phyllis,Meyer,Female,Voolia,Information Systems Manager
246,556,10,Samuel,Bailey,Male,Oyoloo,Nurse
247,547,9,Tina,Watkins,Female,Thoughtstorm,Accountant II
248,252,9,Douglas,Powell,Male,Jetwire,Geologist IV
249,249,6,Anthony,Carpenter,Male,Shuffletag,Health Coach I

In [45]:
#Now the datasets have been merged and Customer ID and ID have become a single column. Axis is to specify if ID is in a column/row.
#left_on and right_on parameters designate the column names from each DataFrame to use in the merge.

In [46]:
#Merge: Inner Joins

In [47]:
#Inner Join is used to join common columns without a right or left side

In [48]:
#Case 1
sales1

     Customer ID  Food ID
0            537        9
1             97        4
2            658        1
3            202        2
4            155        9
..           ...      ...
245          413        9
246          926        6
247          134        3
248          396        6
249          535       10

[250 rows x 2 columns]

In [49]:
sales1[sales1["Customer ID"]==155] #checking if any customer ID is equal to a random ID number 155

    Customer ID  Food ID
4           155        9
17          155        1

In [50]:
#Here the same customer is buying 2 types of foods.

In [51]:
sales2[sales2["Customer ID"]==155]

     Customer ID  Food ID
208          155        3

In [52]:
#In week 2, the same customer bought a food item. This indicates a drop in sales.

In [53]:
sales1.merge(sales2,how="inner",on="Customer ID",suffixes=["- Week 1","- Week 2"])

    Customer ID  Food ID- Week 1  Food ID- Week 2
0           537                9                5
1           155                9                3
2           503                5                8
3           503                5                9
4           155                1                3
..          ...              ...              ...
57          945                5                4
58          343                3                5
59          343                3                2
60          343                3                7
61          621                9                6

[62 rows x 3 columns]

In [54]:
#Inner Join here has merged common IDs

In [55]:
sales1.merge(sales2,how="inner",on="Customer ID") #Not naming the suffixes gives the column names as x and y.

    Customer ID  Food ID_x  Food ID_y
0           537          9          5
1           155          9          3
2           503          5          8
3           503          5          9
4           155          1          3
..          ...        ...        ...
57          945          5          4
58          343          3          5
59          343          3          2
60          343          3          7
61          621          9          6

[62 rows x 3 columns]

In [56]:
#Case 2
sales1.head()

   Customer ID  Food ID
0          537        9
1           97        4
2          658        1
3          202        2
4          155        9

In [57]:
sales2.head()

   Customer ID  Food ID
0          688       10
1          813        7
2          495       10
3          189        5
4          267        3

In [58]:
#Customer ID and Food ID are common columns in both datasets.

In [59]:
sales1.merge(sales2,how="inner", on=["Customer ID", "Food ID"])

   Customer ID  Food ID
0          304        3
1          540        3
2          937       10
3          233        3
4           21        4
5          922        1
6           21        4
7          578        5
8          578        5

In [60]:
#This shows the customers who ordered in both weeks. It also shows the most saleable items.

In [61]:
#Logical conditions

In [62]:
condition_one=sales1["Customer ID"]==578
condition_two=sales1["Food ID"]==5
sales1[condition_one & condition_two]

     Customer ID  Food ID
224          578        5

In [64]:
condition_one=sales2["Customer ID"]==578
condition_two=sales2["Food ID"]==5
sales2[condition_one & condition_two]

     Customer ID  Food ID
29           578        5
189          578        5

In [65]:
#Merge: Outer Joins

In [66]:
sales1.head()

   Customer ID  Food ID
0          537        9
1           97        4
2          658        1
3          202        2
4          155        9

In [67]:
sales2.head()

   Customer ID  Food ID
0          688       10
1          813        7
2          495       10
3          189        5
4          267        3

In [69]:
sales1.merge(sales2,how="outer",on="Customer ID",suffixes=["-Week 1","-Week2"])

     Customer ID  Food ID-Week 1  Food ID-Week2
0              3             2.0            NaN
1              8             NaN            6.0
2             10             2.0            NaN
3             13             NaN            2.0
4             20             1.0            NaN
..           ...             ...            ...
449          985             5.0            NaN
450          991             2.0            NaN
451          994             NaN            2.0
452          996             NaN           10.0
453         1000             2.0            NaN

[454 rows x 3 columns]

In [70]:
sales1.merge(sales2,how="outer",on="Customer ID",suffixes=["-Week 1","-Week2"],indicator=True)

     Customer ID  Food ID-Week 1  Food ID-Week2      _merge
0              3             2.0            NaN   left_only
1              8             NaN            6.0  right_only
2             10             2.0            NaN   left_only
3             13             NaN            2.0  right_only
4             20             1.0            NaN   left_only
..           ...             ...            ...         ...
449          985             5.0            NaN   left_only
450          991             2.0            NaN   left_only
451          994             NaN            2.0  right_only
452          996             NaN           10.0  right_only
453         1000             2.0            NaN   left_only

[454 rows x 4 columns]

In [71]:
#indicator=True will help show the source of each row by adding a new column

In [76]:
merged=sales1.merge(sales2,how="outer",on="Customer ID",suffixes=["-Week 1","-Week2"],indicator=True)
merged

     Customer ID  Food ID-Week 1  Food ID-Week2      _merge
0              3             2.0            NaN   left_only
1              8             NaN            6.0  right_only
2             10             2.0            NaN   left_only
3             13             NaN            2.0  right_only
4             20             1.0            NaN   left_only
..           ...             ...            ...         ...
449          985             5.0            NaN   left_only
450          991             2.0            NaN   left_only
451          994             NaN            2.0  right_only
452          996             NaN           10.0  right_only
453         1000             2.0            NaN   left_only

[454 rows x 4 columns]

In [74]:
merged["_merge"].value_counts()

_merge
right_only    197
left_only     195
both           62
Name: count, dtype: int64

In [73]:
merged[merged["_merge"].isin(["left_only", "right_only"])]

     Customer ID  Food ID-Week 1  Food ID-Week2      _merge
0              3             2.0            NaN   left_only
1              8             NaN            6.0  right_only
2             10             2.0            NaN   left_only
3             13             NaN            2.0  right_only
4             20             1.0            NaN   left_only
..           ...             ...            ...         ...
449          985             5.0            NaN   left_only
450          991             2.0            NaN   left_only
451          994             NaN            2.0  right_only
452          996             NaN           10.0  right_only
453         1000             2.0            NaN   left_only

[392 rows x 4 columns]

In [78]:
customers=pd.read_csv(r"C:\Users\nihar\Downloads\restaurant_customers.csv",index_col="ID")
foods=pd.read_csv(r"C:\Users\nihar\Downloads\restaurant_foods.csv",index_col="Food ID")

In [79]:
customers

     First Name Last Name  Gender       Company                     Occupation
ID
1        Joseph   Perkins    Male       Dynazzy  Community Outreach Specialist
2      Jennifer   Alvarez  Female          DabZ        Senior Quality Engineer
3         Roger     Black    Male       Tagfeed              Account Executive
4        Steven     Evans    Male          Fatz               Registered Nurse
5          Judy  Morrison  Female       Demivee                Legal Assistant
...         ...       ...     ...           ...                            ...
996       Debra    Garcia  Female  Dazzlesphere            Structural Engineer
997     Douglas    Bishop    Male      Livepath                    Developer I
998       Frank  Franklin    Male    Brainverse             Nurse Practicioner
999     Jessica     Burns  Female    Babbleblab              Financial Advisor
1000      Brian   Daniels    Male         Tazzy     Physical Therapy Assistant

[1000 rows x 5 columns]

In [80]:
foods

          Food Item  Price
Food ID
1             Sushi   3.99
2           Burrito   9.99
3              Taco   2.99
4        Quesadilla   4.25
5             Pizza   2.49
6             Pasta  13.99
7             Steak  24.99
8             Salad  11.25
9             Donut   0.99
10            Drink   1.75

In [81]:
sales1.head()

   Customer ID  Food ID
0          537        9
1           97        4
2          658        1
3          202        2
4          155        9

In [82]:
sales2.head()

   Customer ID  Food ID
0          688       10
1          813        7
2          495       10
3          189        5
4          267        3

In [83]:
customers.head()

   First Name Last Name  Gender  Company                     Occupation
ID
1      Joseph   Perkins    Male  Dynazzy  Community Outreach Specialist
2    Jennifer   Alvarez  Female     DabZ        Senior Quality Engineer
3       Roger     Black    Male  Tagfeed              Account Executive
4      Steven     Evans    Male     Fatz               Registered Nurse
5        Judy  Morrison  Female  Demivee                Legal Assistant

In [84]:
foods.head()

          Food Item  Price
Food ID
1             Sushi   3.99
2           Burrito   9.99
3              Taco   2.99
4        Quesadilla   4.25
5             Pizza   2.49

In [86]:
sales1.merge(customers,how="left",left_on="Customer ID",right_index=True).merge(foods,how="left",left_on="Food ID",right_index=True)

,Customer ID,Food ID,First Name,Last Name,Gender,Company,Occupation,Food Item,Price
0,537,9,Cheryl,Carroll,Female,Zoombeat,Registered Nurse,Donut,0.99
1,97,4,Amanda,Watkins,Female,Ozu,Account Coordinator,Quesadilla,4.25
2,658,1,Patrick,Webb,Male,Browsebug,Community Outreach Specialist,Sushi,3.99
3,202,2,Louis,Campbell,Male,Rhynoodle,Account Representative III,Burrito,9.99
4,155,9,Carolyn,Diaz,Female,Gigazoom,Database Administrator III,Donut,0.99
...,...,...,...,...,...,...,...,...,...
245,413,9,Diane,Bailey,Female,Wikibox,Technical Writer,Donut,0.99
246,926,6,Anne,Wagner,Female,Skyba,Legal Assistant,Pasta,13.99
247,134,3,Diana,Hall,Female,Quinu,Financial Advisor,Taco,2.99
248,396,6,Juan,Romero,Male,Zoonder,Analyst Programmer,Pasta,13.99
249,535,10,Nancy,Cox,Female,Trudeo,Research Associate,Drink,1.75

In [99]:
#Now we have merged all the datasets.

In [100]:
#Join: It is a shortcut method for concatenating two DataFrames when merging by index labels.

In [101]:
times=pd.read_csv(r"C:\Users\nihar\Downloads\restaurant_week_1_times.csv")
times

    Time of Day
0      14:54:59
1      20:55:17
2      01:16:22
3      16:17:26
4      19:26:11
..          ...
245    04:44:14
246    07:46:21
247    20:45:08
248    01:09:06
249    18:18:50

[250 rows x 1 columns]

In [102]:
sales1.head()

   Customer ID  Food ID
0          537        9
1           97        4
2          658        1
3          202        2
4          155        9

In [103]:
times.head()

  Time of Day
0    14:54:59
1    20:55:17
2    01:16:22
3    16:17:26
4    19:26:11

In [104]:
sales1.merge(times, how="left", left_index=True, right_index=True) #Longer code

     Customer ID  Food ID Time of Day
0            537        9    14:54:59
1             97        4    20:55:17
2            658        1    01:16:22
3            202        2    16:17:26
4            155        9    19:26:11
..           ...      ...         ...
245          413        9    04:44:14
246          926        6    07:46:21
247          134        3    20:45:08
248          396        6    01:09:06
249          535       10    18:18:50

[250 rows x 3 columns]

In [105]:
sales1.join(times) #Shorter code

     Customer ID  Food ID Time of Day
0            537        9    14:54:59
1             97        4    20:55:17
2            658        1    01:16:22
3            202        2    16:17:26
4            155        9    19:26:11
..           ...      ...         ...
245          413        9    04:44:14
246          926        6    07:46:21
247          134        3    20:45:08
248          396        6    01:09:06
249          535       10    18:18:50

[250 rows x 3 columns]

In [106]:
#fake

In [107]:
#Fake

In [108]:
#fake